Classes | Public Member Functions | Static Public Member Functions | List of all members
ACAPI::MEP::FlexibleSegment Class Referencefinal
MEP Element Manager
In contrast to rigid segments flexible duct is not a connection of multiple elements (straight segments and elbows), instead a type of ducting pipe that could easily be bent in different angles. Since Archicad 28 there is a flexible pipe as well for liquids. FlexibleSegment either has a spline geometry defined by control points, or a polyline geometry, which is defined by alternating straight line parts and spline parts. Line parts are defined by their starting and ending coordinates, while spline parts are defined by control points. These alterning segments must start where the previous one ends. Polyline FlexibleSegemnts are only supported in the Piping domain. In the Ventilation domain FlexibleSegments can only be splines. More...
#include <MEPFlexibleSegment.hpp>
 Inheritance diagram for ACAPI::MEP::FlexibleSegment:
 Classes
class  | Modifier
Modifier of the FlexibleSegment. More...
 Public Member Functions
FlexibleSegmentDefault  | PickUpDefault () const
Picks up the Default from the FlexibleSegment.
double  | GetWidth () const
double  | GetHeight () const
Result< std::vector< API_Coord3D > >  | GetControlPoints () const
Result< FlexibleSegmentPolyline >  | GetPolyline () const
Domain  | GetDomain () const
Returns the domain of the FlexibleSegment.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::MEP::ElementBase
bool  | Exists () const
std::vector< UniqueID >  | GetPortIDs () const
std::vector< UniqueID >  | GetDirectConnectedMEPElementIds () const
API_Coord3D  | GetAnchorPoint () const
Orientation  | GetOrientation () const
API_Guid  | GetObjectId () const
 Public Member Functions inherited from ACAPI::ElementBase
UniqueID  | GetElemId () const
Get unique identifier of the ElementBase object.
Result< void >  | IsEditable () const
Checks whether the element is editable.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Static Public Member Functions
static Result< FlexibleSegment >  | Get (const UniqueID &uniqueId)
Returns a FlexibleSegment.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase
ModifiableElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs a ModifiableElementBase with the IElementBaseImpl.
 Protected Member Functions inherited from ACAPI::MEP::ElementBase
ElementBase (std::shared_ptr< Impl::IElementBaseImpl > impl)
Constructs an ElementBase with an element base implementation.
 Protected Member Functions inherited from ACAPI::ElementBase
ElementBase (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new ElementBase.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
In contrast to rigid segments flexible duct is not a connection of multiple elements (straight segments and elbows), instead a type of ducting pipe that could easily be bent in different angles. Since Archicad 28 there is a flexible pipe as well for liquids. FlexibleSegment either has a spline geometry defined by control points, or a polyline geometry, which is defined by alternating straight line parts and spline parts. Line parts are defined by their starting and ending coordinates, while spline parts are defined by control points. These alterning segments must start where the previous one ends. Polyline FlexibleSegemnts are only supported in the Piping domain. In the Ventilation domain FlexibleSegments can only be splines.
Since
Archicad 27
Example code snippet from Test / New MEP
Getters
 ACAPI::Result<FlexibleSegment> flexibleSegment = FlexibleSegment::Get (id);
 if (flexibleSegment.IsErr ()) {
 ACAPI_WriteReport (flexibleSegment.UnwrapErr ().text.c_str (), false);
 return;
 }
 Reporter reporter;
 reporter.SetTabCount (0);
 reporter.Add ("Control points:");
 reporter.SetTabCount (1);
 ACAPI::Result<std::vector<API_Coord3D>> controlPoints = flexibleSegment->GetControlPoints ();
 if (controlPoints.IsErr ()) {
 ACAPI_WriteReport (controlPoints.UnwrapErr ().text.c_str (), false);
 return;
 }
 for (const API_Coord3D& controlPoint : *controlPoints)
 reporter.Add (ToString (controlPoint));
 reporter.AddNewLine ();
 Modification
 ACAPI::Result<FlexibleSegment> flexibleSegment = FlexibleSegment::Get (id);
 if (flexibleSegment.IsErr ()) {
 ACAPI_WriteReport (flexibleSegment.UnwrapErr ().text.c_str (), false);
 return flexibleSegment.UnwrapErr ().kind;
 }
 if (ACAPI::Result<std::vector<API_Coord3D>> controlPoints = flexibleSegment->GetControlPoints (); controlPoints.IsOk ()) {
 for (API_Coord3D& controlPoint : *controlPoints)
 controlPoint.x += 1.0;
 ACAPI::Result<void> modifyResult = flexibleSegment->Modify ([&](FlexibleSegment::Modifier& modifier) {
 modifier.SetControlPoints (*controlPoints);
 }, "Modify the control points of Flexible Segment.");
 } else if (ACAPI::Result<FlexibleSegmentPolyline> polyline = flexibleSegment->GetPolyline (); polyline.IsOk ()) {
 for (std::variant<FlexibleSegmentPolylineLinePart, FlexibleSegmentPolylineSplinePart>& polylinePart : *polyline) {
 std::visit (GS::Overloaded {
 [] (FlexibleSegmentPolylineLinePart& line) {
 line.begin.x *= 2.0;
 line.begin.y *= 2.0;
 line.begin.z *= 2.0;
 line.end.x *= 2.0;
 line.end.y *= 2.0;
 line.end.z *= 2.0;
 },
 [] (FlexibleSegmentPolylineSplinePart& spline) {
 for (API_Coord3D& controlPoint : spline.controlPoints) {
 controlPoint.x *= 2.0;
 controlPoint.y *= 2.0;
 controlPoint.z *= 2.0;
 }
 }
 }, polylinePart);
 }
 ACAPI::Result<void> modifyResult = flexibleSegment->Modify ([&](FlexibleSegment::Modifier& modifier) {
 modifier.SetPolyline (*polyline);
 }, "Modify the polyline of Flexible Segment.");
 } else {
 return Error;
 }
 return NoError;
Member Function Documentation
◆ Get()
 static Result< FlexibleSegment > ACAPI::MEP::FlexibleSegment::Get  |  ( |  const UniqueID & |  uniqueId | )
static
Returns a FlexibleSegment.
Parameters
uniqueId | The UniqueID of the requested FlexibleSegment.
Returns
If the uniqueId belongs to a FlexibleSegment, returns the object associated to it, otherwise Error.
◆ GetControlPoints()
 Result< std::vector< API_Coord3D > > ACAPI::MEP::FlexibleSegment::GetControlPoints  |  ( |   | ) |   const
Returns
Returns the control points of the FlexibleSegment if it is defined by a spline.
◆ GetDomain()
 Domain ACAPI::MEP::FlexibleSegment::GetDomain  |  ( |   | ) |   const
Returns the domain of the FlexibleSegment.
Returns
The returned domain could only be ventilation.
◆ GetHeight()
 double ACAPI::MEP::FlexibleSegment::GetHeight  |  ( |   | ) |   const
Returns
Returns the height of the FlexibleSegment.
◆ GetPolyline()
 Result< FlexibleSegmentPolyline > ACAPI::MEP::FlexibleSegment::GetPolyline  |  ( |   | ) |   const
Returns
Returns the polyline of the FlexibleSegment if it is defined by a polyline .
◆ GetWidth()
 double ACAPI::MEP::FlexibleSegment::GetWidth  |  ( |   | ) |   const
Returns
Returns the width of the FlexibleSegment.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::FlexibleSegment::Modify  |  ( |  const ModifierFunc & |  modifierFunc,
|  const GS::UniString & |  undoString )
Executes the passed modifier scope in an Undoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
undoString | The text which appears in the undo queue of Archicad after executing the command.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ PickUpDefault()
 FlexibleSegmentDefault ACAPI::MEP::FlexibleSegment::PickUpDefault  |  ( |   | ) |   const
Picks up the Default from the FlexibleSegment.
Returns
Returns a FlexibleSegmentDefault with the parameters of the object it was called for.